# Tap some repos
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'neovim/neovim'

# Mac App Store CLI and apps
brew 'mas'
mas 'Textual', id: 403012667 
mas 'Slack', id: 803453959 
mas 'Napkin', id: 581789185 
mas 'Xcode', id: 497799835 

# Other core apps not from App Store
cask 'dropbox'
cask '1password'
cask 'docker'
cask 'caffeine'
cask 'github-desktop'
cask 'sketch'
cask 'paintcode'
cask 'google-chrome'
cask 'firefox'
cask 'alfred'
cask 'pgadmin4'
cask 'kitematic'
cask 'jetbrains-toolbox'

brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'boost'
brew 'cmake'
brew 'confuse'
brew 'coreutils'
brew 'openssl'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'wxmac'

# Erlang/Elixir Development packages incl. Nerves
brew 'erlang'
brew 'elixir'
brew 'postgresql', restart_service: true
brew 'pgcli'
brew 'rebar'
brew 'squashfs'
brew 'fwup'
brew 'mix-completion'

# Ruby
brew 'ruby-build'
brew 'rbenv'

brew 'xz'
brew 'libarchive'
brew 'libsodium'
brew 'gdbm'
brew 'gettext'
brew 'lua'
brew 'highlight'
brew 'icu4c'
brew 'jemalloc'
brew 'libtermkey'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'lzo'
brew 'msgpack'
brew 'readline'
brew 'sqlite'
brew 'python3'
brew 'pkg-config'
brew 'unibilium'
brew 'wget'
brew 'neovim/neovim/neovim'

# Quicklook plugins 
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

cask 'tunnelblick'
